Repository: bkamphues/vfxim-docs
Catalog: locale/*/LC_MESSAGES/docs/user/pipeline/pipeline_quick.po
Languages: nl

source: Quick Startup Guide
nl: Snelle Opstart Gids

source: This guide describes how to quickly get started with using the pipeline.
nl: Deze gids beschrijft hoe je snel up-and-running kan zijn met het gebruik van de pipeline.

source: Technical Directors or developers in your class should have taken care of the installation of `Shotgun Desktop <https://support.shotgunsoftware.com/hc/en-us/articles/219040668-Desktop-download-and-setup>`_. This program will launch your programs inside a pipeline environment in which you can load your tasks, assets, shots etc.
nl: Technical Directors of developers in de lichting zouden moeten regelen dat `Shotgun Desktop <https://support.shotgunsoftware.com/hc/en-us/articles/219040668-Desktop-download-and-setup>`_ geïnstalleerd is op je computer.Dit programma opent je programma's in een pipeline omgeving waarmee je jouw toegewezen taken, assets, shots etc. kan openen.

source: Shotgun Desktop can be launched by typing *Shotgun* in your Windows search bar:
nl: Shotgun Desktop can worden geopend door in de Windows zoekbalk *Shotgun* in te typen:

source: When starting Shotgun Desktop for the first time, you'll be greeted with a login prompt:
nl: Wanneer Shotgun Desktop voor het eerst opstart zal het vragen om login gegevens:

source: Fourth and third years should be using ``https://nfa.shotgunstudio.com`` as their main task management! ``https://nfa2.shotgunstudio.com`` is meant for testing and second years.
nl: Vierde- en derdejaars horen ``https://nfa.shotgunstudio.com`` te gebruiken voor hun taak management.``https://nfa2.shotgunstudio.com`` is bedoelt voor het testen en gebruik van de tweedejaars.

source: Fill out the login info provided by your coordinator or supervisor and you'll be greeted with all projects you are assigned to:
nl: Vul de login gegevens in die zijn toegewezen door je coördinator of supervisor en je wordt gegroet met alle projecten waar je aan bent toegevoegd:

source: You may need to start up Shotgun Desktop again here as it sometimes bugs out after clicking sign in.
nl: Je moet wellicht Shotgun Desktop even opnieuw opstarten na het invullen van je login gegevens. Soms bugt het namelijk in Windows.

source: Launching DCC's
nl: Opstarten van DCC's

source: Double click the project you want to work on and the pipeline configuration will automatically be downloaded. Here you should see all the installed software that are configured with the pipeline. Double click any package you would like to use and the pipeline does the rest.
nl: Dubbel klik op het project waaraan je wilt werken en de pipeline configuratie download automatisch alle benodigde software.Hier zou je alle geïnstalleerde software moeten zien die geconfigureerd is met de pipeline. Dubbel klik op een pakket dat je wilt gebruiken en de pipeline doet de rest.

source: *ZBrush* is currently not supported in the pipeline due to a lack of a *Python* API. Check the :ref:`zbrush_publishing` to see how you can still publish your sculpts to the pipeline.
nl: *ZBrush* is op dit moment nog niet gesupport in de pipeline vanwege de afwezigheid van een *Python* API. Check de :ref:`zbrush_publishing` om te zien hoe je alsnog sculpts kan publiceren naar de pipeline.
