Repository: bkamphues/vfxim-docs
Catalog: locale/*/LC_MESSAGES/docs/maintenance.po
Languages: nl

source: Maintenance
nl: Onderhoud

source: As with any long standing project, this documentation needs maintenance every once in a while. This maintenance is done by curators who add, edit and, if necessary, delete articles. The following sections describe how said maintenance is done and the conventions surrounding it.
nl: Zoals met de meeste langdurige projecten heeft ook deze documentatie onderhoud nodig. Dit onderhoud wordt gedaan door curatoren die artikelen toevoegen, aanpassen en, wanneer nodig, verwijderen. The volgende secties beschrijven hoe genoemde onderhoud wordt gedaan en de afgesproken conventies.

source: Curator Information
nl: Curator Informatie

source: This documentation is hosted through `Read the Docs <readthedocs.org>`_, an industry-standard way of creating documentation for software or in-house guides. Some examples of companies using *RTD* are:
nl: Deze documentatie wordt gehost door `Read the Docs <readthedocs.org>`_, een industrie standaard manier om documentatie voor software of in-house gidsen/tutorials. Een aantal voorbeelden van bedrijven die *RTD* gebruiken:

source: *RTD* documentation pages are written in a format called `ReStructuredText <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`_. *ReST* is a markup language which means that some characters like an asterisk (#) or an underscore (_) have a different meaning. You may have seen a similiar markup language like *HTML* or *Markdown* in use on websites or GitHub repositories. It takes time to get the hang of writing in *ReST*, but with the help of this `cheatsheet <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`_ you'll get the gist of it quickly. It is recommended to use an *IDE* that supports syntax highlighting for *ReST* so it will tell you when you correctly type directives. This `Visual Studio Code extension <https://marketplace.visualstudio.com/items?itemName=lextudio.restructuredtext>`_ takes care of that for you.
nl: *RTD* documentatie pagina's worden in het `ReStructuredText <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`_ formaat geschreven. *ReST* is een markup taal, wat betekent dat sommige characters zoals een asterisk (#) of een underscore (_) een andere betekenis hebben dan alleen tekst. Je hebt wellicht vergelijkbare formaten zoals *HTML* of *Markdown* in gebruik gezien op websites of GitHub. Het kost wat moeite en tijd om te schrijven in *ReST*, maar met de help van dit `cheatsheet <https://thomas-cokelaer.info/tutorials/sphinx/rest_syntax.html>`_ heb je de basis al snel te pakken. Het is aanbevolen om een *IDE* te gebruiken die de syntax van *ReST* support zodat het programma aangeeft wanneer je in correct *ReST* schrijft. Deze `Visual Studio Code extensie <https://marketplace.visualstudio.com/items?itemName=lextudio.restructuredtext>`_ regelt dat voor je.

source: This documentation is hosted through *RTD*, but the actual working code resides in a `GitHub repository <https://github.com/nfa-vfxim/docs>`_. The website automatically builds itself whenever a commit is pushed to one of the branches of the repository. It is highly recommended to get the hang of Git through your *IDE* and/or the commandline to accurately curate the documentation.
nl: Deze documentatie wordt gehost via *RTD*, maar de daadwerkelijke source bestanden zijn te vinden in onze `GitHub repository <https://github.com/nfa-vfxim/docs>`_. De website bouwt automatisch een nieuwe versie wanneer een commit is gepushed naar een branch van de repository. Het is erg aanbevolen om een basis begrip van Git the hebben, via je *IDE* en/of commandline, om netjes de documentatie te onderhouden.

source: If you need a primer on how to use GitHub and Git, `this <https://guides.github.com/introduction/git-handbook/>`_ might be a good place to start.
nl: Als je een basis les nodig hebt over het gebruik van Git en Github is `dit <https://guides.github.com/introduction/git-handbook/>`_ een goede plek om te beginnen.

source: In order to work on this documentation, you should have a working version of ``poetry``, the *Python* dependency manager that installs all necessary software. You can install ``poetry`` through ``pip``. If you do not have pip installed, you should first check if you have a working version of *Python*.
nl: Om aan deze documentatie te werken moet je een werkende versie van ``poetry`` hebben. Poetry is een *Python* dependency manager die alle benodigde software installeert om te werken aan deze documentatie. Je kan ``poetry`` installeren via het ``pip`` commando. Als je pip niet geïnstalleerd hebt zal je eerst moeten checken of je wel een werkende versie van *Python* hebt.

source: Install poetry through pip:
nl: Installeer poetry via pip:

source: Maintenance Process
nl: Onderhoud Process

source: The process for adding or editing the current documentation is as follows:
nl: Het process voor het veranderen of toevoegen aan de huidige documentatie gaat als volgt:

source: The curator forks the main repository or creates a new branch for the edits in mind [#f1]_.
nl: De curator forked van de main repository of creërt een nieuwe branch voor de gewenste aanpassingen [#f1]_.

source: The curator edits or adds articles, pages and sections according to the `Conventions`_.
nl: De curator veranderd of voegt artikelen, pagina's en secties toe volgens de `Conventies`_.

source: The curator generates translations and/or manually translates the article.
nl: De curator genereert vertaling files en/of vertaalt handmatig de artikelen.

source: The curator commits all changes.
nl: De curator commit all veranderingen.

source: The curator creates a pull request with another curator as reviewer so the edits can be double checked before merged into the entire documentation.
nl: De curator creërt een pull request met een andere curator als reviewer zodat de edits dubbel gechecked kunnen worden voordat ze in de algehele documentatie verschijnen.

source: Maintenance Guide
nl: Onderhoud Gids

source: Please note that this guide is meant for simple edits or the addition of just one page. If really big edits are to be done it would be recommended to checkout the other files first to see how their *ReStructuredText* is formatted.
nl: Hou er rekening mee dat deze gids bedoeld is voor simpele verandering of de toevoeging van een enkele pagina. Als er grote veranderingen worden toegepast is het aanbevolen om eerst andere files te bekijken om te zien hoe hun *ReStructuredText* is opgebouwd.

source: First, fork the repository or create a branch [#f1]_ from the main repository. After that, clone the repository:
nl: Fork eerst de repository of creër een nieuwe branch [#f1]_ van de main repository. Clone daarna de repository lokaal naar je computer:

source: ``<repository link>`` should be replaced with the appropriate link for the repository. If a new branch was created for the edits you'd like to make you need to checkout to that branch:
nl: ``<repository link>`` moet vervangen worden met de bijbehorende link van de repository. Als een nieuwe branch was gecreërd voor de aanpassingen die je zou willen toevoegen, moet je naar die branch switchen:

source: ``<branch name>`` should be replaced with the name of the new branch.
nl: ``<branch name>`` moet vervangen worden met de name van de nieuwe branch.

source: To make sure all dependencies are installed, run:
nl: Om te zorgen dat alle dependencies zijn geïnstalleerd, voer het volgende commando uit:

source: Next, start editing the articles you'd like to edit or copy the ``template.rst`` file to a section inside ``\docs`` to create a new page. Make sure to follow the `Conventions`_. Next, the localization files need to be updated. First, build the current set of ``.rst`` files from the current directory [#f2]_:
nl: Vervolgens kan je de aanpassingen in de pagina's toevoegen of kopiëer je de ``template.rst`` naar een sectie binnen ``\docs`` om een nieuwe pagina te maken. Zorg dat je de `Conventies`_ goed volgt. Vervolgens moeten de localizatie (vertaling) files geupdate worden. Bouw eerst een nieuwe set ``.rst`` files vanuit de huidige map [#f2]_:

source: Next, update the English and Dutch localization files:
nl: Vervolgens update je de Engels en Nederlandse localizatie bestanden:

source: Next, you need to push the committed changes to the remote repository:
nl: Vervolgens moet je de gecommitte veranderingen uploaden naar de remote repository:

source: If you don't use a GUI tool to manage your Git directory you'll probably run into a password prompt right about here. Though the commandline is a very useful and powerful feature, it's a lot easier to use *VS Code* or *Git GUI* to manage your commits.
nl: Als je geen GUI tool gebruikt om je Git mappen te beheren zal je hier waarschijnlijk voor een password prompt. De commandline is een onwijs handige en machtige tool, maar in dit geval is het soms makkelijker om via *VS Code* of *Git GUI* je Git veranderingen te beheren.

source: Finally, create a pull request and assign a reviewer. If the reviewer accepts all changes, the website will automatically update the build.
nl: Tot slot creër je een pull request en wijs je een reviewer toe. Wanneer de reviewer al je veranderingen accepteert zal de website automatisch een nieuwe versie bouwen van de documentatie.

source: Because it is normal to not operate on the current stable release of anything, it is possible to see the final result in a working version. This version is nothing more than a branch in Github, but that branch needs to be activated through `readthedocs.org <readthedocs.org>`_.
nl: Omdat het over het algemeen professioneel is om niet op de huidige stabiele release van een project veranderingen te maken is het ook mogelijk om het eindresultaat alvast te zien in een werk versie. Deze versie is niets meer dan een branch op Github, maar deze branch moet wel geactiveerd op `readthedocs.org <readthedocs.org>`_.

source: Conventions
nl: Conventies

source: The ``template.rst`` will allow you to follow the conventions as closely as possible, but here's a small list of things to think about when writing articles for the documentation:
nl: Het ``template.rst`` bestand zal ervoor zorgen dat je de conventies automatisch al deels volgt, maar hier is een kleine lijst om rekening mee te houden tijdens het schrijven in artikelen van de documentatie:

source: Always start the page with a title.
nl: Begin een pagina altijd met een hoofdtitel.

source: A page should always end with a ``.. sectionauthor: Your Name`` directive to differentiate who has written what on the website.
nl: Een pagina moet altijd eindigen met een ``.. sectionauthor: Je Naam`` directive om te onderscheiden wie het artikel heeft geschreven op de website.

source: Use admonitions and other formatting tools often and precisely. It's better to be too explainfull than having a vague documentation.
nl: Gebruik admonitions en andere formatterings tools zo vaak en precies mogelijk. Het is beter om té duidelijk te zijn dan een vage documentatie hebben.

source: Footnotes
nl: Voetnoten

source: Creating a new branch is only possible if the curator is added as a collaborator in GitHub or the project ownership is handed off to him/her.
nl: De creatie van een nieuwe branch is alleen mogelijk als de curator is toegevoegd als collaborator in Github of als eigenaar van het project.
